# Data frame

1. Creating data frames from files (esp. CSV)
2. Methods that we can run on a data frame
3. Using `.loc` and `.iloc` to retrieve and set data

In [1]:
# comma separated values
# character separated values

import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = pd.read_csv('taxi.csv')

In [3]:
!head taxi.csv

VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954429626464844,40.764141082763672,1,N,-73.974754333496094,40.754093170166016,2,17,0,0.5,0,0,0.3,17.8
2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,.46,-73.971443176269531,40.758941650390625,1,N,-73.978538513183594,40.761909484863281,1,6.5,0,0.5,1,0,0.3,8.3
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,.87,-73.978111267089844,40.738433837890625,1,N,-73.990272521972656,40.745437622070313,1,8,0,0.5,2.2,0,0.3,11
2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892333984375,40.773529052734375,1,N,-73.971527099609375,40.760330200195312,1,13.5,0,0.5,2.86,0,0.3,17.16
1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979087829589844,40.776771545410156,1,N,-73.982162475585937,40.758998870849609,2,9.5,0,0.5,0,0,0.3,10.3
1,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,-73.94464111328125,40.779464721679688,1,N,-73.96136474609375,40.771560668945313,1,8,0,0.5,1.75,0,0.3,10.55
1,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,-73.992866516113281,40.748210906982422,1,N,-73.969772338867187,40.748458862304687,1,12.5,0,0.5,3,0,0.3,16.3
1,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,-73.863075256347656,40.769252777099609,1,N,-73.986709594726563,40.761306762695313,1,52.5,0,0.5,15,5.54,0.3,73.84
2,2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,-73.991432189941406,40.749305725097656,1,N,-73.985061645507813,40.759525299072266,2,15,0,0.5,0,0,0.3,15.8

In [4]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [5]:
# what dtype is each column?

df.dtypes

VendorID                   int64
tpep_pickup_datetime      object
tpep_dropoff_datetime     object
passenger_count            int64
trip_distance            float64
pickup_longitude         float64
pickup_latitude          float64
RateCodeID                 int64
store_and_fwd_flag        object
dropoff_longitude        float64
dropoff_latitude         float64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
dtype: object

In [6]:
s = Series('abcd ef ghi jklm'.split())
s

0    abcd
1      ef
2     ghi
3    jklm
dtype: object

In [7]:
s = s.astype('int64')

ValueError: invalid literal for int() with base 10: 'abcd'

In [8]:
s = Series('123 45 67 890'.split())
s

0    123
1     45
2     67
3    890
dtype: object

In [9]:
s.astype('int64')

0    123
1     45
2     67
3    890
dtype: int64

In [10]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]', *, sep: 'str | None | lib.NoDefault' = <no_default>, delimiter: 'str | None | lib.NoDefault' = None, header: "int | Sequence[int] | None | Literal['infer']" = 'infer', names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>, index_col: 'IndexLabel | Literal[False] | None' = None, usecols: 'UsecolsArgType' = None, dtype: 'DtypeArg | None' = None, engine: 'CSVEngine | None' = None, converters: 'Mapping[Hashable, Callable] | None' = None, true_values: 'list | None' = None, false_values: 'list | None' = None, skipinitialspace: 'bool' = False, skiprows: 'list[int] | int | Callable[[Hashable], bool] | None' = None, skipfooter: 'int' = 0, nrows: 'int | None' = None, na_values: 'Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None' = None, keep_default_na: 'bool' = True, na_filter: 'bool' = True, verbose: 'bool | lib.NoDefault' = <no_default>, skip_blank_lines: 'bool' = True, parse_dates: 'bool | Sequence[Hashable] | None' = None, infer_datetime_format: 'bool | lib.NoDefault' = <no_default>, keep_date_col: 'bool | lib.NoDefault' = <no_default>, date_parser: 'Callable | lib.NoDefault' = <no_default>, date_format: 'str | dict[Hashable, str] | None' = None, dayfirst: 'bool' = False, cache_dates: 'bool' = True, iterator: 'bool' = False, chunksize: 'int | None' = None, compression: 'CompressionOptions' = 'infer', thousands: 'str | None' = None, decimal: 'str' = '.', lineterminator: 'str | None' = None, quotechar: 'str' = '"', quoting: 'int' = 0, doublequote: 'bool' = True, escapechar: 'str | None' = None, comment: 'str | None' = None, encoding: 'str | None' = None, encoding_errors: 'str | None' = 'strict', dialect: 'str | csv.Dialect | None' = None, on_bad_lines: 'str' = 'error', delim_whitespace: 'bool | lib.NoDefault' = <no_default>, low_memory: 'bool' = True, memory_map: 'bool' = False, float_precision: "Literal['high', 'legacy'] | None" = None, storage_options: 'StorageOptions | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>) -> 'DataFrame | TextFileReader'
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Character or regex pattern to treat as the delimiter. If ``sep=None``, the
        C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator from only the first valid
        row of the file by Python's builtin sniffer tool, ``csv.Sniffer``.
        In addition, separators longer than 1 character and different from
        ``'\s+'`` will be interpreted as regular expressions and will also force
        the use of the Python parsing engine. Note that regex delimiters are prone
        to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, optional
        Alias for ``sep``.
    header : int, Sequence of int, 'infer' or None, default 'infer'
        Row number(s) containing column labels and marking the start of the
        data (zero-indexed). Default behavior is to infer the column names: if no ``names``
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly to ``names`` then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a :class:`~pandas.MultiIndex` on the columns
        e.g. ``[0, 1, 3]``. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : Sequence of Hashable, optional
        Sequence of column labels to apply. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : Hashable, Sequence of Hashable or False, optional
      Column(s) to use as row label(s), denoted either by column labels or column
      indices.  If a sequence of labels or indices is given, :class:`~pandas.MultiIndex`
      will be formed for the row labels.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g., when you have a malformed file with delimiters at
      the end of each line.
    usecols : Sequence of Hashable or Callable, optional
        Subset of columns to select, denoted either by column labels or column indices.
        If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in ``names`` or
        inferred from the document header row(s). If ``names`` are given, the document
        header row(s) are not taken into account. For example, a valid list-like
        ``usecols`` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a :class:`~pandas.DataFrame` from ``data`` with element order
        preserved use ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]``
        for columns in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to ``True``. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    dtype : dtype or dict of {Hashable : dtype}, optional
        Data type(s) to apply to either the whole dataset or individual columns.
        E.g., ``{'a': np.float64, 'b': np.int32, 'c': 'Int64'}``
        Use ``str`` or ``object`` together with suitable ``na_values`` settings
        to preserve and not interpret ``dtype``.
        If ``converters`` are specified, they will be applied INSTEAD
        of ``dtype`` conversion.

        .. versionadded:: 1.5.0

            Support for ``defaultdict`` was added. Specify a ``defaultdict`` as input where
            the default determines the ``dtype`` of the columns which are not explicitly
            listed.
    engine : {'c', 'python', 'pyarrow'}, optional
        Parser engine to use. The C and pyarrow engines are faster, while the python engine
        is currently more feature-complete. Multithreading is currently only supported by
        the pyarrow engine.

        .. versionadded:: 1.4.0

            The 'pyarrow' engine was added as an *experimental* engine, and some features
            are unsupported, or may not work correctly, with this engine.
    converters : dict of {Hashable : Callable}, optional
        Functions for converting values in specified columns. Keys can either
        be column labels or column indices.
    true_values : list, optional
        Values to consider as ``True`` in addition to case-insensitive variants of 'True'.
    false_values : list, optional
        Values to consider as ``False`` in addition to case-insensitive variants of 'False'.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : int, list of int or Callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (``int``)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning ``True`` if the row should be skipped and ``False`` otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with ``engine='c'``).
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : Hashable, Iterable of Hashable or dict of {Hashable : Iterable}, optional
        Additional strings to recognize as ``NA``/``NaN``. If ``dict`` passed, specific
        per-column ``NA`` values.  By default the following values are interpreted as
        ``NaN``: " ", "#N/A", "#N/A N/A", "#NA", "-1.#IND", "-1.#QNAN", "-NaN", "-nan",
        "1.#IND", "1.#QNAN", "<NA>", "N/A", "NA", "NULL", "NaN", "None",
        "n/a", "nan", "null ".

    keep_default_na : bool, default True
        Whether or not to include the default ``NaN`` values when parsing the data.
        Depending on whether ``na_values`` is passed in, the behavior is as follows:

        * If ``keep_default_na`` is ``True``, and ``na_values`` are specified, ``na_values``
          is appended to the default ``NaN`` values used for parsing.
        * If ``keep_default_na`` is ``True``, and ``na_values`` are not specified, only
          the default ``NaN`` values are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are specified, only
          the ``NaN`` values specified ``na_values`` are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are not specified, no
          strings will be parsed as ``NaN``.

        Note that if ``na_filter`` is passed in as ``False``, the ``keep_default_na`` and
        ``na_values`` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of ``na_values``). In
        data without any ``NA`` values, passing ``na_filter=False`` can improve the
        performance of reading a large file.
    verbose : bool, default False
        Indicate number of ``NA`` values placed in non-numeric columns.

        .. deprecated:: 2.2.0
    skip_blank_lines : bool, default True
        If ``True``, skip over blank lines rather than interpreting as ``NaN`` values.
    parse_dates : bool, list of Hashable, list of lists or dict of {Hashable : list}, default False
        The behavior is as follows:

        * ``bool``. If ``True`` -> try parsing the index. Note: Automatically set to
          ``True`` if ``date_format`` or ``date_parser`` arguments have been passed.
        * ``list`` of ``int`` or names. e.g. If ``[1, 2, 3]`` -> try parsing columns 1, 2, 3
          each as a separate date column.
        * ``list`` of ``list``. e.g.  If ``[[1, 3]]`` -> combine columns 1 and 3 and parse
          as a single date column. Values are joined with a space before parsing.
        * ``dict``, e.g. ``{'foo' : [1, 3]}`` -> parse columns 1, 3 as date and call
          result 'foo'. Values are joined with a space before parsing.

        If a column or index cannot be represented as an array of ``datetime``,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an ``object`` data type. For
        non-standard ``datetime`` parsing, use :func:`~pandas.to_datetime` after
        :func:`~pandas.read_csv`.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If ``True`` and ``parse_dates`` is enabled, pandas will attempt to infer the
        format of the ``datetime`` strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.

        .. deprecated:: 2.0.0
            A strict version of this argument is now the default, passing it has no effect.

    keep_date_col : bool, default False
        If ``True`` and ``parse_dates`` specifies combining multiple columns then
        keep the original columns.
    date_parser : Callable, optional
        Function to use for converting a sequence of string columns to an array of
        ``datetime`` instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. pandas will try to call ``date_parser`` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by ``parse_dates``) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by ``parse_dates`` into a single array
        and pass that; and 3) call ``date_parser`` once for each row using one or
        more strings (corresponding to the columns defined by ``parse_dates``) as
        arguments.

        .. deprecated:: 2.0.0
           Use ``date_format`` instead, or read in as ``object`` and then apply
           :func:`~pandas.to_datetime` as-needed.
    date_format : str or dict of column -> format, optional
        Format to use for parsing dates when used in conjunction with ``parse_dates``.
        The strftime to parse time, e.g. :const:`"%d/%m/%Y"`. See
        `strftime documentation
        <https://docs.python.org/3/library/datetime.html
        #strftime-and-strptime-behavior>`_ for more information on choices, though
        note that :const:`"%f"` will parse all the way up to nanoseconds.
        You can also pass:

        - "ISO8601", to parse any `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601>`_
            time string (not necessarily in exactly the same format);
        - "mixed", to infer the format for each element individually. This is risky,
            and you should probably use it along with `dayfirst`.

        .. versionadded:: 2.0.0
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If ``True``, use a cache of unique, converted dates to apply the ``datetime``
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

    iterator : bool, default False
        Return ``TextFileReader`` object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Number of lines to read from the file per chunk. Passing a value will cause the
        function to return a ``TextFileReader`` object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
        (otherwise no compression).
        If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
        Set to ``None`` for no decompression.
        Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'xz'``, ``'tar'``} and
        other key-value pairs are forwarded to
        ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, ``zstandard.ZstdDecompressor``, ``lzma.LZMAFile`` or
        ``tarfile.TarFile``, respectively.
        As an example, the following could be passed for Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionadded:: 1.5.0
            Added support for `.tar` files.

        .. versionchanged:: 1.4.0 Zstandard support.

    thousands : str (length 1), optional
        Character acting as the thousands separator in numerical values.
    decimal : str (length 1), default '.'
        Character to recognize as decimal point (e.g., use ',' for European data).
    lineterminator : str (length 1), optional
        Character used to denote a line break. Only valid with C parser.
    quotechar : str (length 1), optional
        Character used to denote the start and end of a quoted item. Quoted
        items can include the ``delimiter`` and it will be ignored.
    quoting : {0 or csv.QUOTE_MINIMAL, 1 or csv.QUOTE_ALL, 2 or csv.QUOTE_NONNUMERIC, 3 or csv.QUOTE_NONE}, default csv.QUOTE_MINIMAL
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Default is
        ``csv.QUOTE_MINIMAL`` (i.e., 0) which implies that only fields containing special
        characters are quoted (e.g., characters defined in ``quotechar``, ``delimiter``,
        or ``lineterminator``.
    doublequote : bool, default True
       When ``quotechar`` is specified and ``quoting`` is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive ``quotechar`` elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        Character used to escape other characters.
    comment : str (length 1), optional
        Character indicating that the remainder of line should not be parsed.
        If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter ``header`` but not by
        ``skiprows``. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in ``'a,b,c'`` being
        treated as the header.
    encoding : str, optional, default 'utf-8'
        Encoding to use for UTF when reading/writing (ex. ``'utf-8'``). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    encoding_errors : str, optional, default 'strict'
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: ``delimiter``, ``doublequote``, ``escapechar``,
        ``skipinitialspace``, ``quotechar``, and ``quoting``. If it is necessary to
        override values, a ``ParserWarning`` will be issued. See ``csv.Dialect``
        documentation for more details.
    on_bad_lines : {'error', 'warn', 'skip'} or Callable, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

        - ``'error'``, raise an Exception when a bad line is encountered.
        - ``'warn'``, raise a warning when a bad line is encountered and skip that line.
        - ``'skip'``, skip bad lines without raising or warning when they are encountered.

        .. versionadded:: 1.3.0

        .. versionadded:: 1.4.0


In [11]:
# usecols -- list of strings (or ints), what columns we want

df = pd.read_csv('taxi.csv',
                usecols=['passenger_count', 'trip_distance', 'total_amount'])

In [13]:
df.shape

(9999, 3)

In [14]:

df = pd.read_csv('taxi2.csv',
                usecols=['passenger_count', 'trip_distance', 'total_amount'])

In [15]:
df.head()

   passenger_count  trip_distance  total_amount
0                1           1.63         17.80
1                1           0.46          8.30
2                1           0.87         11.00
3                1           2.13         17.16
4                1           1.40         10.30

In [18]:

df = pd.read_csv('taxi2.csv')

In [19]:
df.columns

Index(['VendorID', 'tpep_pickup_datetime', 'tpep_dropoff_datetime',
       'passenger_count', 'trip_distance', 'trip_distance.2',
       'trip_distance.1', 'trip_distance.1.1', 'store_and_fwd_flag',
       'dropoff_longitude', 'dropoff_latitude', 'payment_type', 'fare_amount',
       'extra', 'mta_tax', 'tip_amount', 'tolls_amount',
       'improvement_surcharge', 'total_amount'],
      dtype='object')

In [20]:
df = pd.read_csv('taxi.csv',
                usecols=['trip_distance', 'passenger_count', 'total_amount'])
df

      passenger_count  trip_distance  total_amount
0                   1           1.63         17.80
1                   1           0.46          8.30
2                   1           0.87         11.00
3                   1           2.13         17.16
4                   1           1.40         10.30
...               ...            ...           ...
9994                1           2.70         12.30
9995                1           4.50         20.30
9996                1           5.59         22.30
9997                6           1.54          7.80
9998                1           5.80         26.75

[9999 rows x 3 columns]

In [21]:
df.index

RangeIndex(start=0, stop=9999, step=1)

In [22]:
df.columns

Index(['passenger_count', 'trip_distance', 'total_amount'], dtype='object')

In [23]:
df.columns = list('abc')
df

      a     b      c
0     1  1.63  17.80
1     1  0.46   8.30
2     1  0.87  11.00
3     1  2.13  17.16
4     1  1.40  10.30
...  ..   ...    ...
9994  1  2.70  12.30
9995  1  4.50  20.30
9996  1  5.59  22.30
9997  6  1.54   7.80
9998  1  5.80  26.75

[9999 rows x 3 columns]

In [24]:
# request via the index using .loc
df.loc[4]

a     1.0
b     1.4
c    10.3
Name: 4, dtype: float64

In [25]:
df.loc[[4,5]]

   a    b      c
4  1  1.4  10.30
5  1  1.4  10.55

In [26]:
df.iloc[[4,5]]

   a    b      c
4  1  1.4  10.30
5  1  1.4  10.55

In [28]:
df.loc[4:6]    # a slice here is up to and including!

   a    b      c
4  1  1.4  10.30
5  1  1.4  10.55
6  1  1.8  16.30

In [30]:
df.iloc[4:6]   # up to and *not* including!

   a    b      c
4  1  1.4  10.30
5  1  1.4  10.55

In [31]:
# all of the aggregation methods that we know work
# we'll get an answer for each column 
df.mean()

a     1.659466
b     3.158511
c    17.552472
dtype: float64

In [32]:
df.min()

a    0.0
b    0.0
c   -7.8
dtype: float64

In [33]:
df.max()

a      6.00
b     64.60
c    252.35
dtype: float64

In [34]:
df.std()

a     1.333306
b     4.037516
c    15.137990
dtype: float64

In [35]:
df.describe()

                 a            b            c
count  9999.000000  9999.000000  9999.000000
mean      1.659466     3.158511    17.552472
std       1.333306     4.037516    15.137990
min       0.000000     0.000000    -7.800000
25%       1.000000     1.000000     8.800000
50%       1.000000     1.700000    12.800000
75%       2.000000     3.300000    19.800000
max       6.000000    64.600000   252.350000

In [36]:
df.head()

   a     b      c
0  1  1.63  17.80
1  1  0.46   8.30
2  1  0.87  11.00
3  1  2.13  17.16
4  1  1.40  10.30

In [37]:
df.tail()

      a     b      c
9994  1  2.70  12.30
9995  1  4.50  20.30
9996  1  5.59  22.30
9997  6  1.54   7.80
9998  1  5.80  26.75

In [38]:
# [] work on the columns, not the rows!

df['a']

0       1
1       1
2       1
3       1
4       1
       ..
9994    1
9995    1
9996    1
9997    6
9998    1
Name: a, Length: 9999, dtype: int64

In [39]:
df[['a', 'c']]

      a      c
0     1  17.80
1     1   8.30
2     1  11.00
3     1  17.16
4     1  10.30
...  ..    ...
9994  1  12.30
9995  1  20.30
9996  1  22.30
9997  6   7.80
9998  1  26.75

[9999 rows x 2 columns]

In [43]:
# find all of the elements of a
# where a > 1

df['a'].loc [df['a'] > 1 ]

7       4
10      3
13      2
15      2
27      5
       ..
9966    2
9983    3
9985    2
9989    6
9997    6
Name: a, Length: 2790, dtype: int64

In [44]:
# we can do that to the entire data frame!
df.loc[df['a'] > 1 ]

      a      b      c
7     4  11.90  73.84
10    3   0.01  52.80
13    2   0.50   6.60
15    2   0.60   4.80
27    5   1.35   8.80
...  ..    ...    ...
9966  2   2.70  14.15
9983  3   1.78   9.96
9985  2   1.68   8.80
9989  6   1.34   8.76
9997  6   1.54   7.80

[2790 rows x 3 columns]

# Exercise: Taxi rides

Use the file at https://files.lerner.co.il/data-science-exercise-files.zip

1. Load `taxi.csv` into a data frame. We only want `passenger_count`, `trip_distance`, and `total_amount` columns.
2. What percentage of trips had each value of `passenger_count`?
3. For trips with 0 passengers, what was the mean `trip_distance` and `total_amount`?
4. Were there trips that cost $0 or less? What was the mean `trip_distance` of such trips?
5. Were there trips that went 0 miles? How much did they cost, on average?

In [45]:
pd.__version__

'2.2.3'

In [46]:
df = pd.read_csv('taxi.csv',
                usecols=['passenger_count', 'trip_distance', 'total_amount'])
df.shape

(9999, 3)

In [49]:
df['passenger_count'].value_counts() / df['passenger_count'].count()

passenger_count
1    0.720772
2    0.131313
5    0.052005
3    0.040604
6    0.036904
4    0.018202
0    0.000200
Name: count, dtype: float64

In [50]:
df['passenger_count'].value_counts(normalize=True)

passenger_count
1    0.720772
2    0.131313
5    0.052005
3    0.040604
6    0.036904
4    0.018202
0    0.000200
Name: proportion, dtype: float64

In [57]:
# 3. For trips with 0 passengers, what was the mean `trip_distance` and `total_amount`?

(
    df
    .loc[df['passenger_count'] == 0]
    [['trip_distance', 'total_amount']]
    .mean()
)

trip_distance     4.60
total_amount     25.57
dtype: float64

In [59]:
# 3. For trips with 0 passengers, what was the mean `trip_distance` and `total_amount`?

(
    df
    .loc[df['passenger_count'] == 0]
    [['trip_distance', 'total_amount']]
    .agg(['mean'])
)

      trip_distance  total_amount
mean            4.6         25.57

In [60]:
# 4. Were there trips that cost $0 or less? What was the mean `trip_distance` of such trips?

(
    df
    .loc[df['total_amount'] <= 0]
    [['trip_distance']]
    .agg(['mean'])
)

      trip_distance
mean       0.606667

In [62]:
# 5. Were there trips that went 0 miles? How much did they cost, on average?

(
    df
    .loc[df['trip_distance'] == 0]
    ['total_amount']
    .agg(['count', 'mean'])
)

count    67.00000
mean     31.58194
Name: total_amount, dtype: float64

In [63]:

(
    df
    [df['trip_distance'] == 0]
)

      passenger_count  trip_distance  total_amount
149                 1            0.0          4.30
246                 1            0.0          3.30
297                 2            0.0          2.30
657                 1            0.0         15.35
660                 1            0.0          3.30
...               ...            ...           ...
9016                1            0.0          6.30
9087                2            0.0         69.99
9093                1            0.0         66.00
9740                1            0.0          4.30
9761                1            0.0          5.80

[67 rows x 3 columns]

# `.loc.`

`.loc` takes one or two arguments:

1. Row selector
    - list of indexes
    - boolean index
    - function that returns a boolean index
2. Column selector
    - list of columns
    - (rare) boolean index
    - (even rarer) function that returns a boolean index

In [66]:
(
    df
    .loc[
     [10, 20, 30, 40]  # row selector
    ,
    ['passenger_count', 'trip_distance'] # column selector
    ]
)

    passenger_count  trip_distance
10                3           0.01
20                1           3.90
30                6           0.81
40                1           0.80

In [72]:
(
    df
    .loc[lambda df_: df_['passenger_count'] > 1]
    .loc[lambda df_: df_['trip_distance'] > 10]
    .loc[lambda df_: df_['total_amount'] < 50,
                ['total_amount', 'trip_distance']
       ]
    .describe()
)

       total_amount  trip_distance
count     82.000000      82.000000
mean      42.065732      11.706585
std        5.450304       1.466337
min       29.800000      10.030000
25%       38.455000      10.605000
50%       42.955000      11.185000
75%       46.715000      12.590000
max       49.840000      15.910000

# Next up

1. CSV options
2. Other file formats
3. More data frame methods

Resume at :25

# Headers

We can pass the `header` keyword argument:

- If we pass an integer, it's the row (starting with 0) of the file to read the heaaders
- If we pass `None`, then there are no headers stated

In [79]:
df = pd.read_csv('taxi2.csv', header=3)
df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,trip_distance.2,trip_distance.1,trip_distance.1.1,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [81]:
df = pd.read_csv('taxi2.csv', header=None)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18
0,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,trip_distance,trip_distance.1,trip_distance.1,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
1,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954429626464844,40.764141082763672,1,N,-73.974754333496094,40.754093170166016,2,17,0,0.5,0,0,0.3,17.8
2,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,.46,-73.971443176269531,40.758941650390625,1,N,-73.978538513183594,40.761909484863281,1,6.5,0,0.5,1,0,0.3,8.3
3,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,.87,-73.978111267089844,40.738433837890625,1,N,-73.990272521972656,40.745437622070313,1,8,0,0.5,2.2,0,0.3,11
4,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892333984375,40.773529052734375,1,N,-73.971527099609375,40.760330200195312,1,13.5,0,0.5,2.86,0,0.3,17.16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792053222656,40.814971923828125,1,N,-73.973358154296875,40.783638000488281,2,11,0.5,0.5,0,0,0.3,12.3
9996,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066467285156,40.747817993164063,1,N,-73.953758239746094,40.779285430908203,1,16,0.5,0.5,3,0,0.3,20.3
9997,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377136230469,40.766101837158203,1,N,-73.903205871582031,40.750545501708984,2,21,0.5,0.5,0,0,0.3,22.3
9998,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302001953125,40.748531341552734,1,N,-73.989166259765625,40.762851715087891,2,6.5,0.5,0.5,0,0,0.3,7.8
9999,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.98321533203125,40.726413726806641,1,N,-73.92413330078125,40.701644897460938,1,21,0.5,0.5,4.45,0,0.3,26.75

In [94]:
df = pd.read_csv('airlines.dat', 
                 header=None,
                names=[ 'index_from_file', 'name', 'junk', '2code', '3code',
                      'fullname', 'country', 'binary'],
                 usecols=['index_from_file', 'name', 'country'],
                sep=',',
                 index_col='index_from_file'
                )   
df

                                                         name         country
index_from_file
1                                              Private flight             NaN
2                                                 135 Airways   United States
3                                               1Time Airline    South Africa
4                2 Sqn No 1 Elementary Flying Training School  United Kingdom
5                                             213 Flight Unit          Russia
...                                                       ...             ...
19828                                              Vuela Cuba            Cuba
19830                                           All Australia       Australia
19831                                              Fly Europa           Spain
19834                                             FlyPortugal        Portugal
19845                                    FTI Fluggesellschaft         Germany

[6048 rows x 2 columns]

In [93]:
# don't include index column
# use default index (0 - size)

df = pd.read_csv('airlines.dat', 
                 header=None,
                names=[ 'index', 'name', 'junk', '2code', '3code',
                      'fullname', 'country', 'binary'],
                 usecols=['name', 'country'],
                sep=',',
                )   
df

                                              name         country
0                                   Private flight             NaN
1                                      135 Airways   United States
2                                    1Time Airline    South Africa
3     2 Sqn No 1 Elementary Flying Training School  United Kingdom
4                                  213 Flight Unit          Russia
...                                            ...             ...
6043                                    Vuela Cuba            Cuba
6044                                 All Australia       Australia
6045                                    Fly Europa           Spain
6046                                   FlyPortugal        Portugal
6047                          FTI Fluggesellschaft         Germany

[6048 rows x 2 columns]

In [98]:
df = pd.read_csv('airlines.dat', 
                 header=None,
                names=[ 'index_from_file', 'name', 'junk', '2code', '3code',
                      'fullname', 'country', 'binary'],
                 usecols=['index_from_file', 'name', 'country'],
                sep=',',
                 index_col='country'
                )   
df

                index_from_file                                          name
country
NaN                           1                                Private flight
United States                 2                                   135 Airways
South Africa                  3                                 1Time Airline
United Kingdom                4  2 Sqn No 1 Elementary Flying Training School
Russia                        5                               213 Flight Unit
...                         ...                                           ...
Cuba                      19828                                    Vuela Cuba
Australia                 19830                                 All Australia
Spain                     19831                                    Fly Europa
Portugal                  19834                                   FlyPortugal
Germany                   19845                          FTI Fluggesellschaft

[6048 rows x 2 columns]

In [96]:
df.loc['Israel']

         index_from_file                            name
country
Israel               231           Arkia Israel Airlines
Israel               594        Ayeet Aviation & Tourism
Israel              1220                  Aeroel Airways
Israel              1581             CAL Cargo Air Lines
Israel              1755               Chim-Nir Aviation
Israel              2150           El Al Israel Airlines
Israel              2175  Elrom Aviation and Investments
Israel              2952      Israel Aircraft Industries
Israel              2953               Israeli Air Force
Israel              2954                          Israir
Israel              3014                Jet G&D Aviation
Israel              3016                        Jet Link
Israel              3099            Kanaf-Arkia Airlines
Israel              3100         Kanfey Ha'emek Aviation
Israel              3585                 Nanyah Aviation
Israel              3748                    Noy Aviation
Israel              3800                 Orange Aviation
Israel              4146                    Ray Aviation
Israel              4619                        Sun D'Or
Israel              4789                 Snunit Aviation
Israel              4985                   Tamir Airways
Israel             10128                      Dennis Sky

In [99]:
df.index

Index([             nan,  'United States',   'South Africa', 'United Kingdom',
               'Russia',         'Russia',         'Russia', 'United Kingdom',
        'United States',  'United States',
       ...
               'Brazil',       'Colombia',        'Uruguay',      'Venezuela',
                'Chile',           'Cuba',      'Australia',          'Spain',
             'Portugal',        'Germany'],
      dtype='object', name='country', length=6048)

In [108]:
# read /etc/passwd into a data frame

df = pd.read_csv('/etc/passwd',
                sep=':',
                 comment='#',
                 header=None,
                 names=['username', 'pw', 'uid', 'gid', 'name', 'homedir', 'shell'],
                 index_col='username'
                )
df

,pw,uid,gid,name,homedir,shell
username,,,,,,
nobody,*,-2,-2,Unprivileged User,/var/empty,/usr/bin/false
root,*,0,0,System Administrator,/var/root,/bin/sh
daemon,*,1,1,System Services,/var/root,/usr/bin/false
_uucp,*,4,4,Unix to Unix Copy Protocol,/var/spool/uucp,/usr/sbin/uucico
_taskgated,*,13,13,Task Gate Daemon,/var/empty,/usr/bin/false
...,...,...,...,...,...,...
_audiomxd,*,294,294,Audio and MediaExperience Daemon,/var/db/audiomxd,/usr/bin/false
_terminusd,*,295,295,Terminus,/var/empty,/usr/bin/false
_neuralengine,*,296,296,AppleNeuralEngine,/var/db/neuralengine,/usr/bin/false
_eligibilityd,*,297,297,OS Eligibility Daemon,/var/db/eligibilityd,/usr/bin/false
_oahd,*,441,441,OAH Daemon,/var/empty,/usr/bin/false

In [107]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]', *, sep: 'str | None | lib.NoDefault' = <no_default>, delimiter: 'str | None | lib.NoDefault' = None, header: "int | Sequence[int] | None | Literal['infer']" = 'infer', names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>, index_col: 'IndexLabel | Literal[False] | None' = None, usecols: 'UsecolsArgType' = None, dtype: 'DtypeArg | None' = None, engine: 'CSVEngine | None' = None, converters: 'Mapping[Hashable, Callable] | None' = None, true_values: 'list | None' = None, false_values: 'list | None' = None, skipinitialspace: 'bool' = False, skiprows: 'list[int] | int | Callable[[Hashable], bool] | None' = None, skipfooter: 'int' = 0, nrows: 'int | None' = None, na_values: 'Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None' = None, keep_default_na: 'bool' = True, na_filter: 'bool' = True, verbose: 'bool | lib.NoDefault' = <no_default>, skip_blank_lines: 'bool' = True, parse_dates: 'bool | Sequence[Hashable] | None' = None, infer_datetime_format: 'bool | lib.NoDefault' = <no_default>, keep_date_col: 'bool | lib.NoDefault' = <no_default>, date_parser: 'Callable | lib.NoDefault' = <no_default>, date_format: 'str | dict[Hashable, str] | None' = None, dayfirst: 'bool' = False, cache_dates: 'bool' = True, iterator: 'bool' = False, chunksize: 'int | None' = None, compression: 'CompressionOptions' = 'infer', thousands: 'str | None' = None, decimal: 'str' = '.', lineterminator: 'str | None' = None, quotechar: 'str' = '"', quoting: 'int' = 0, doublequote: 'bool' = True, escapechar: 'str | None' = None, comment: 'str | None' = None, encoding: 'str | None' = None, encoding_errors: 'str | None' = 'strict', dialect: 'str | csv.Dialect | None' = None, on_bad_lines: 'str' = 'error', delim_whitespace: 'bool | lib.NoDefault' = <no_default>, low_memory: 'bool' = True, memory_map: 'bool' = False, float_precision: "Literal['high', 'legacy'] | None" = None, storage_options: 'StorageOptions | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>) -> 'DataFrame | TextFileReader'
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Character or regex pattern to treat as the delimiter. If ``sep=None``, the
        C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator from only the first valid
        row of the file by Python's builtin sniffer tool, ``csv.Sniffer``.
        In addition, separators longer than 1 character and different from
        ``'\s+'`` will be interpreted as regular expressions and will also force
        the use of the Python parsing engine. Note that regex delimiters are prone
        to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, optional
        Alias for ``sep``.
    header : int, Sequence of int, 'infer' or None, default 'infer'
        Row number(s) containing column labels and marking the start of the
        data (zero-indexed). Default behavior is to infer the column names: if no ``names``
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly to ``names`` then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a :class:`~pandas.MultiIndex` on the columns
        e.g. ``[0, 1, 3]``. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : Sequence of Hashable, optional
        Sequence of column labels to apply. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : Hashable, Sequence of Hashable or False, optional
      Column(s) to use as row label(s), denoted either by column labels or column
      indices.  If a sequence of labels or indices is given, :class:`~pandas.MultiIndex`
      will be formed for the row labels.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g., when you have a malformed file with delimiters at
      the end of each line.
    usecols : Sequence of Hashable or Callable, optional
        Subset of columns to select, denoted either by column labels or column indices.
        If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in ``names`` or
        inferred from the document header row(s). If ``names`` are given, the document
        header row(s) are not taken into account. For example, a valid list-like
        ``usecols`` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a :class:`~pandas.DataFrame` from ``data`` with element order
        preserved use ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]``
        for columns in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to ``True``. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    dtype : dtype or dict of {Hashable : dtype}, optional
        Data type(s) to apply to either the whole dataset or individual columns.
        E.g., ``{'a': np.float64, 'b': np.int32, 'c': 'Int64'}``
        Use ``str`` or ``object`` together with suitable ``na_values`` settings
        to preserve and not interpret ``dtype``.
        If ``converters`` are specified, they will be applied INSTEAD
        of ``dtype`` conversion.

        .. versionadded:: 1.5.0

            Support for ``defaultdict`` was added. Specify a ``defaultdict`` as input where
            the default determines the ``dtype`` of the columns which are not explicitly
            listed.
    engine : {'c', 'python', 'pyarrow'}, optional
        Parser engine to use. The C and pyarrow engines are faster, while the python engine
        is currently more feature-complete. Multithreading is currently only supported by
        the pyarrow engine.

        .. versionadded:: 1.4.0

            The 'pyarrow' engine was added as an *experimental* engine, and some features
            are unsupported, or may not work correctly, with this engine.
    converters : dict of {Hashable : Callable}, optional
        Functions for converting values in specified columns. Keys can either
        be column labels or column indices.
    true_values : list, optional
        Values to consider as ``True`` in addition to case-insensitive variants of 'True'.
    false_values : list, optional
        Values to consider as ``False`` in addition to case-insensitive variants of 'False'.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : int, list of int or Callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (``int``)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning ``True`` if the row should be skipped and ``False`` otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with ``engine='c'``).
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : Hashable, Iterable of Hashable or dict of {Hashable : Iterable}, optional
        Additional strings to recognize as ``NA``/``NaN``. If ``dict`` passed, specific
        per-column ``NA`` values.  By default the following values are interpreted as
        ``NaN``: " ", "#N/A", "#N/A N/A", "#NA", "-1.#IND", "-1.#QNAN", "-NaN", "-nan",
        "1.#IND", "1.#QNAN", "<NA>", "N/A", "NA", "NULL", "NaN", "None",
        "n/a", "nan", "null ".

    keep_default_na : bool, default True
        Whether or not to include the default ``NaN`` values when parsing the data.
        Depending on whether ``na_values`` is passed in, the behavior is as follows:

        * If ``keep_default_na`` is ``True``, and ``na_values`` are specified, ``na_values``
          is appended to the default ``NaN`` values used for parsing.
        * If ``keep_default_na`` is ``True``, and ``na_values`` are not specified, only
          the default ``NaN`` values are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are specified, only
          the ``NaN`` values specified ``na_values`` are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are not specified, no
          strings will be parsed as ``NaN``.

        Note that if ``na_filter`` is passed in as ``False``, the ``keep_default_na`` and
        ``na_values`` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of ``na_values``). In
        data without any ``NA`` values, passing ``na_filter=False`` can improve the
        performance of reading a large file.
    verbose : bool, default False
        Indicate number of ``NA`` values placed in non-numeric columns.

        .. deprecated:: 2.2.0
    skip_blank_lines : bool, default True
        If ``True``, skip over blank lines rather than interpreting as ``NaN`` values.
    parse_dates : bool, list of Hashable, list of lists or dict of {Hashable : list}, default False
        The behavior is as follows:

        * ``bool``. If ``True`` -> try parsing the index. Note: Automatically set to
          ``True`` if ``date_format`` or ``date_parser`` arguments have been passed.
        * ``list`` of ``int`` or names. e.g. If ``[1, 2, 3]`` -> try parsing columns 1, 2, 3
          each as a separate date column.
        * ``list`` of ``list``. e.g.  If ``[[1, 3]]`` -> combine columns 1 and 3 and parse
          as a single date column. Values are joined with a space before parsing.
        * ``dict``, e.g. ``{'foo' : [1, 3]}`` -> parse columns 1, 3 as date and call
          result 'foo'. Values are joined with a space before parsing.

        If a column or index cannot be represented as an array of ``datetime``,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an ``object`` data type. For
        non-standard ``datetime`` parsing, use :func:`~pandas.to_datetime` after
        :func:`~pandas.read_csv`.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If ``True`` and ``parse_dates`` is enabled, pandas will attempt to infer the
        format of the ``datetime`` strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.

        .. deprecated:: 2.0.0
            A strict version of this argument is now the default, passing it has no effect.

    keep_date_col : bool, default False
        If ``True`` and ``parse_dates`` specifies combining multiple columns then
        keep the original columns.
    date_parser : Callable, optional
        Function to use for converting a sequence of string columns to an array of
        ``datetime`` instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. pandas will try to call ``date_parser`` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by ``parse_dates``) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by ``parse_dates`` into a single array
        and pass that; and 3) call ``date_parser`` once for each row using one or
        more strings (corresponding to the columns defined by ``parse_dates``) as
        arguments.

        .. deprecated:: 2.0.0
           Use ``date_format`` instead, or read in as ``object`` and then apply
           :func:`~pandas.to_datetime` as-needed.
    date_format : str or dict of column -> format, optional
        Format to use for parsing dates when used in conjunction with ``parse_dates``.
        The strftime to parse time, e.g. :const:`"%d/%m/%Y"`. See
        `strftime documentation
        <https://docs.python.org/3/library/datetime.html
        #strftime-and-strptime-behavior>`_ for more information on choices, though
        note that :const:`"%f"` will parse all the way up to nanoseconds.
        You can also pass:

        - "ISO8601", to parse any `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601>`_
            time string (not necessarily in exactly the same format);
        - "mixed", to infer the format for each element individually. This is risky,
            and you should probably use it along with `dayfirst`.

        .. versionadded:: 2.0.0
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If ``True``, use a cache of unique, converted dates to apply the ``datetime``
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

    iterator : bool, default False
        Return ``TextFileReader`` object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Number of lines to read from the file per chunk. Passing a value will cause the
        function to return a ``TextFileReader`` object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
        (otherwise no compression).
        If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
        Set to ``None`` for no decompression.
        Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'xz'``, ``'tar'``} and
        other key-value pairs are forwarded to
        ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, ``zstandard.ZstdDecompressor``, ``lzma.LZMAFile`` or
        ``tarfile.TarFile``, respectively.
        As an example, the following could be passed for Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionadded:: 1.5.0
            Added support for `.tar` files.

        .. versionchanged:: 1.4.0 Zstandard support.

    thousands : str (length 1), optional
        Character acting as the thousands separator in numerical values.
    decimal : str (length 1), default '.'
        Character to recognize as decimal point (e.g., use ',' for European data).
    lineterminator : str (length 1), optional
        Character used to denote a line break. Only valid with C parser.
    quotechar : str (length 1), optional
        Character used to denote the start and end of a quoted item. Quoted
        items can include the ``delimiter`` and it will be ignored.
    quoting : {0 or csv.QUOTE_MINIMAL, 1 or csv.QUOTE_ALL, 2 or csv.QUOTE_NONNUMERIC, 3 or csv.QUOTE_NONE}, default csv.QUOTE_MINIMAL
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Default is
        ``csv.QUOTE_MINIMAL`` (i.e., 0) which implies that only fields containing special
        characters are quoted (e.g., characters defined in ``quotechar``, ``delimiter``,
        or ``lineterminator``.
    doublequote : bool, default True
       When ``quotechar`` is specified and ``quoting`` is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive ``quotechar`` elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        Character used to escape other characters.
    comment : str (length 1), optional
        Character indicating that the remainder of line should not be parsed.
        If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter ``header`` but not by
        ``skiprows``. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in ``'a,b,c'`` being
        treated as the header.
    encoding : str, optional, default 'utf-8'
        Encoding to use for UTF when reading/writing (ex. ``'utf-8'``). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    encoding_errors : str, optional, default 'strict'
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: ``delimiter``, ``doublequote``, ``escapechar``,
        ``skipinitialspace``, ``quotechar``, and ``quoting``. If it is necessary to
        override values, a ``ParserWarning`` will be issued. See ``csv.Dialect``
        documentation for more details.
    on_bad_lines : {'error', 'warn', 'skip'} or Callable, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

        - ``'error'``, raise an Exception when a bad line is encountered.
        - ``'warn'``, raise a warning when a bad line is encountered and skip that line.
        - ``'skip'``, skip bad lines without raising or warning when they are encountered.

        .. versionadded:: 1.3.0

        .. versionadded:: 1.4.0


# Exercise: Airline info

1. Create a data frame from the airlines file, with four columns: Name, 2-character code, 3-character code, and the country.
2. What 5 countries have the most airlines?

https://files.lerner.co.il  -- data science exercises

https://files.lerner.co.il/data-science-exercise-files.zip

In [118]:
df = pd.read_csv('airlines.dat',
                header=None,
                usecols=[1, 3, 4, 6],
                names=['name', '2code', '3code', 'country'],
                na_values=[r'\N'])
df.head()

                                           name 2code 3code         country
0                                Private flight     -   NaN             NaN
1                                   135 Airways   NaN   GNL   United States
2                                 1Time Airline    1T   RNX    South Africa
3  2 Sqn No 1 Elementary Flying Training School   NaN   WYT  United Kingdom
4                               213 Flight Unit   NaN   TFU          Russia

In [114]:
df.dtypes

name       object
2code      object
3code      object
country    object
dtype: object

In [119]:
df.describe()

                     name 2code 3code        country
count                6048  1460  5796           6030
unique               5959  1089  5765            275
top     National Airlines    1I   WDY  United States
freq                    5     7     2           1080

In [120]:
df['country'].value_counts().head(5)

country
United States     1080
Mexico             439
United Kingdom     407
Canada             318
Russia             230
Name: count, dtype: int64

In [124]:
# how many NaNs?
(
    df
    ['country']
    .isna()
    .value_counts()
)

country
False    6030
True       18
Name: count, dtype: int64

In [126]:
# how many NaN values in each column?
df.isna().sum()

name          0
2code      4588
3code       252
country      18
dtype: int64

In [129]:
# drop any row with even one NaN
df.dropna()

                  name 2code 3code        country
2        1Time Airline    1T   RNX   South Africa
9          40-Mile Air    Q5   MLA  United States
12    Ansett Australia    AN   AAA      Australia
14     Abelag Aviation    W9   AAB        Belgium
20          Aigle Azur    ZI   AAF         France
...                ...   ...   ...            ...
6042  Regionalia Chile    9J   CR1          Chile
6043        Vuela Cuba    6C   6CC           Cuba
6044     All Australia    88   8K8      Australia
6045        Fly Europa    ER   RWW          Spain
6046       FlyPortugal    PO   FPT       Portugal

[1208 rows x 4 columns]

In [130]:
# drop any row with even one NaN
# we can set the threshold for good (non-NaN) values
df.dropna(thresh=2)

                                              name 2code 3code         country
0                                   Private flight     -   NaN             NaN
1                                      135 Airways   NaN   GNL   United States
2                                    1Time Airline    1T   RNX    South Africa
3     2 Sqn No 1 Elementary Flying Training School   NaN   WYT  United Kingdom
4                                  213 Flight Unit   NaN   TFU          Russia
...                                            ...   ...   ...             ...
6043                                    Vuela Cuba    6C   6CC            Cuba
6044                                 All Australia    88   8K8       Australia
6045                                    Fly Europa    ER   RWW           Spain
6046                                   FlyPortugal    PO   FPT        Portugal
6047                          FTI Fluggesellschaft   NaN   FTI         Germany

[6048 rows x 4 columns]

In [131]:
# drop any row with even one NaN
# we can set the threshold for good (non-NaN) values
df.dropna(subset=['name', 'country'])

                                              name 2code 3code         country
1                                      135 Airways   NaN   GNL   United States
2                                    1Time Airline    1T   RNX    South Africa
3     2 Sqn No 1 Elementary Flying Training School   NaN   WYT  United Kingdom
4                                  213 Flight Unit   NaN   TFU          Russia
5                    223 Flight Unit State Airline   NaN   CHD          Russia
...                                            ...   ...   ...             ...
6043                                    Vuela Cuba    6C   6CC            Cuba
6044                                 All Australia    88   8K8       Australia
6045                                    Fly Europa    ER   RWW           Spain
6046                                   FlyPortugal    PO   FPT        Portugal
6047                          FTI Fluggesellschaft   NaN   FTI         Germany

[6030 rows x 4 columns]

In [132]:
!ls

'Apple - 2024-09September-09.ipynb'   airlines.dat   taxi2.csv~
'Apple - 2024-09September-12.ipynb'   taxi.csv	     titanic3.xls
'Apple - 2024-09September-26.ipynb'   taxi2.csv

In [133]:
df = pd.read_excel('titanic3.xls')

In [134]:
df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [136]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)'

all_dfs = pd.read_html(url)

In [137]:
len(all_dfs)

7

In [142]:
df = all_dfs[2]
df.columns = ['country', 'IMF forecast', 'IMF year', 'WB estimate', 'WB year', 'UN estimate', 'UN year']

In [143]:
df

,country,IMF forecast,IMF year,WB estimate,WB year,UN estimate,UN year
0,World,109529216,2024,105435540,2023,100834796,2022
1,United States,28781083,2024,27360935,2023,25744100,2022
2,China,18532633,[n 1]2024,17794782,[n 3]2023,17963170,[n 1]2022
3,Germany,4591100,2024,4456081,2023,4076923,2022
4,Japan,4110452,2024,4212945,2023,4232173,2022
...,...,...,...,...,...,...,...
205,Kiribati,311,2024,279,2023,223,2022
206,Palau,308,2024,263,2023,225,2022
207,Marshall Islands,305,2024,284,2023,279,2022
208,Nauru,161,2024,154,2023,147,2022
209,Tuvalu,66,2024,62,2023,59,2022

In [144]:
df.dtypes

country         object
IMF forecast    object
IMF year        object
WB estimate     object
WB year         object
UN estimate     object
UN year         object
dtype: object

In [152]:
# df['IMF year'].str.replace(r'^.*(\d{4}).*$', r'\1', regex=True).astype('int64')
df['IMF year'].str.replace(r'\d*[^\d]', r'\1', regex=True).astype('int64')

error: invalid group reference 1 at position 1

In [156]:
dir(df['IMF year'].str)

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__frozen',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_data',
 '_doc_args',
 '_freeze',
 '_get_series_list',
 '_index',
 '_inferred_dtype',
 '_is_categorical',
 '_is_string',
 '_name',
 '_orig',
 '_parent',
 '_validate',
 '_wrap_result',
 'capitalize',
 'casefold',
 'cat',
 'center',
 'contains',
 'count',
 'decode',
 'encode',
 'endswith',
 'extract',
 'extractall',
 'find',
 'findall',
 'fullmatch',
 'get',
 'get_dummies',
 'index',
 'isalnum',
 'isalpha',
 'isdecimal',
 'isdigit',
 'islower',
 'isnumeric',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'len',
 'ljust',
 'lower',
 'lstrip',
 'match',
 'normalize',
 'pad',
 'partition',
 'removeprefix',
 'removesuffix',
 'repeat',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'slice',
 'slice_replace',
 'split',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'wrap',
 'zfill']

In [158]:
df.to_json('gdp.json')

In [159]:
%timeit pd.read_csv('taxi.csv')

27 ms  454 s per loop (mean  std. dev. of 7 runs, 10 loops each)

In [160]:
df =  pd.read_csv('taxi.csv')

In [161]:
df.to_parquet('taxi.parquet')

In [162]:
df.to_feather('taxi.feather')

In [163]:
!ls -lh taxi.*

-rw-r--r-- 1 reuven staff 1.5M Sep 26 09:52 taxi.csv
-rw-r--r-- 1 reuven staff 558K Sep 26 12:37 taxi.feather
-rw-r--r-- 1 reuven staff 350K Sep 26 12:37 taxi.parquet

In [164]:
!zip taxi.zip taxi.csv

  adding: taxi.csv (deflated 74%)

In [165]:
!ls -lh taxi.*

-rw-r--r-- 1 reuven staff 1.5M Sep 26 09:52 taxi.csv
-rw-r--r-- 1 reuven staff 558K Sep 26 12:37 taxi.feather
-rw-r--r-- 1 reuven staff 350K Sep 26 12:37 taxi.parquet
-rw-r--r-- 1 reuven staff 397K Sep 26 12:38 taxi.zip

In [166]:
%timeit pd.read_csv('taxi.zip')

30.3 ms  543 s per loop (mean  std. dev. of 7 runs, 10 loops each)

In [167]:
%timeit pd.read_parquet('taxi.parquet')

5.6 ms  811 s per loop (mean  std. dev. of 7 runs, 1 loop each)

In [168]:
%timeit pd.read_feather('taxi.feather')

3.5 ms  113 s per loop (mean  std. dev. of 7 runs, 100 loops each)